{
  "backend/main.mo": "Main Motoko actor defining Event, Artist, and UserProfile types with CRUD operations, access-controlled endpoints for user profiles and radar events, and seed data initialization for three techno artists and their events.",
  "feature_evidence.json": "Feature evidence report listing three high-confidence features (REQ-67, REQ-68, REQ-69) requiring Dice and Songkick ticket-search buttons on EventCard, ArtistEventPopup, and MyRadarPage, with removal of generic ra.co links.",
  "frontend-file-summaries.txt": "JSON map of frontend file paths to short summaries describing each component's purpose, covering pages, hooks, components, and configuration files for the Techno Beacon app.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark themes including background, foreground, card, border, and chart color tokens.",
  "frontend/index.html": "HTML entry point for the Techno Beacon app, loading the React app via main.tsx and setting the page title and favicon.",
  "frontend/src/App.tsx": "Root React component setting up TanStack Router with routes for Discover, Artists, Artist Detail, and My Radar pages, plus a Layout wrapper with Navigation, footer, ProfileSetupModal, and Toaster.",
  "frontend/src/components/AdminInitButton.tsx": "Admin-only button component that triggers seed data initialization via a mutation, showing success/error states with toast notifications and an 'Admin only' badge.",
  "frontend/src/components/ArtistCard.tsx": "Displays an artist card with image, genre, event count, and follow/unfollow toggle button. Clicking the card opens an event popup; a separate button navigates to the artist detail page.",
  "frontend/src/components/ArtistEventPopup.tsx": "Modal popup that lists upcoming events for a given artist, allowing authenticated users to add/remove events from their radar and open a trip planner. Each event row shows date, venue, source badge, and ticket search link.",
  "frontend/src/components/EventCard.tsx": "Card component for a single event showing title, artist name, date/time, location, and source badge, with a radar toggle button and trip planner modal trigger.",
  "frontend/src/components/EventFilters.tsx": "Filter bar with inputs for artist name, city, and date range used to narrow down event listings. Displays active filter chips and a clear-all button when filters are applied.",
  "frontend/src/components/LoginPrompt.tsx": "Centered UI prompt shown to unauthenticated users, displaying a title, message, and a login button that triggers Internet Identity authentication.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with logo, desktop and mobile nav links (Discover, Artists, My Radar), and auth controls for login/logout using Internet Identity. Shows the user's profile name or truncated principal when authenticated.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their name to set up their profile before accessing the app. Submits the name via the `useSaveCallerUserProfile` mutation and blocks interaction until completed.",
  "frontend/src/components/SourceBadge.tsx": "A small badge component that displays the event data source (e.g., Resident Advisor, Bandsintown) with source-specific color styling.",
  "frontend/src/components/TripPlannerModal.tsx": "A modal that helps users plan travel to an event by entering a home city and budget level, then generating Skyscanner and Booking.com links with pre-filled dates and destination.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing ICP Internet Identity authentication, including login, logout, and persisted identity state via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data, including events, artists, user profiles, and tracked artists, wiring each to the actor and identity context.",
  "frontend/src/index.css": "Global stylesheet defining a dark industrial techno theme with OKLCH color tokens, neon amber/green accent utilities, custom fonts (Space Grotesk/Mono), and keyframe animations for neon glow effects.",
  "frontend/src/lib/eventIdLookup.ts": "A static lookup table mapping composite keys of `artistId + dateTime` (nanoseconds) to backend event IDs, with a helper function `getBackendEventId` to retrieve them.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ArtistDetailPage.tsx": "Detail page for a single artist showing their profile, follow/unfollow toggle, and a sorted list of upcoming events.",
  "frontend/src/pages/ArtistsPage.tsx": "Page listing all artists with a search filter, per-artist event counts, and error/loading states with retry support.",
  "frontend/src/pages/DiscoverPage.tsx": "Main discovery page displaying upcoming techno events with a hero banner, artist/city/date filters, and error handling.",
  "frontend/src/pages/MyRadarPage.tsx": "Authenticated user page showing tracked artists and saved events with ticket search links to Dice and Songkick.",
  "frontend/src/pages/NotFoundPage.tsx": "404 page with a pulsing radio icon and a link back to the home route.",
  "frontend/src/utils/ticketSearch.ts": "Utility that builds search URLs for Dice and Songkick given a platform name and artist name.",
  "frontend/src/utils/travelLinks.ts": "Utility module mapping city names to IATA airport codes and providing helpers to build Skyscanner/Booking.com travel URLs from event data.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including neon color palette, Space Grotesk/Mono fonts, box shadows, animations, and plugin imports for typography, container queries, and animate.",
  "project_state.json": "Project state document for Techno Beacon app tracking version 49, summarizing architecture, known issues (artist data not loading, admin seed data broken), and existing feature inventory."
}