{
  "backend/main.mo": "Main Motoko actor defining data types (Event, Artist, UserProfile) and CRUD operations for a techno event tracking app, with access control for admin/user roles and seed data initialization.",
  "feature_evidence.json": "Feature evidence report listing two features: fixing AdminInitButton admin detection/rendering and ensuring useActor hook signals readiness correctly, with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, describing their purpose and key implementation details for build planning reference.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, border, chart, and sidebar color tokens.",
  "frontend/index.html": "HTML entry point for the Techno Beacon app, setting the page title, favicon, and mounting the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all page routes, wraps the app in QueryClientProvider and ThemeProvider, and renders Navigation, ProfileSetupModal, and Toaster in the shared Layout.",
  "frontend/src/components/AdminInitButton.tsx": "Admin-only React component that checks identity initialization, actor readiness, and admin status before rendering a seed data initialization button with loading, success, and error states.",
  "frontend/src/components/ArtistCard.tsx": "Displays an artist card with image, genre, event count, and a follow/unfollow button; navigates to the artist detail page on click and opens an ArtistEventPopup when the events button is clicked.",
  "frontend/src/components/ArtistEventPopup.tsx": "A dialog popup that lists upcoming events for a given artist, allowing authenticated users to add/remove events from their radar and open a TripPlannerModal.",
  "frontend/src/components/EventCard.tsx": "Renders a single event card with venue, date/time, artist name, radar toggle button, ticket links, and a trip planner modal trigger.",
  "frontend/src/components/EventFilters.tsx": "Provides filter inputs for artist name, city, and date range with active filter chips and a clear-all button, emitting filter state changes via a callback.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a centered authentication prompt with a configurable title and message, and a login button that triggers Internet Identity login.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with logo, nav links (Discover, Artists, My Radar), and auth controls (login/logout) supporting both desktop and mobile layouts.",
  "frontend/src/components/ProfileSetupModal.tsx": "A blocking dialog modal that prompts newly authenticated users to enter their name and save a profile before accessing the app.",
  "frontend/src/components/SourceBadge.tsx": "Renders a colored badge for event sources (Resident Advisor, Bandsintown, Festicket) with source-specific neon color styles. Abbreviates 'Resident Advisor' to 'RA'.",
  "frontend/src/components/TripPlannerModal.tsx": "Modal dialog that helps users plan travel to an event by generating Skyscanner flight and Booking.com hotel links based on a home city, event location, and budget level. Persists the home city to localStorage.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage. Invalidates and refetches dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status. Includes helpers for session persistence and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including fetching events, artists, radar events, tracked artists, and mutations for toggling tracking and radar membership.",
  "frontend/src/index.css": "Global stylesheet importing Space Grotesk and Space Mono fonts, defining Tailwind base/component/utility layers, dark-mode CSS variables, neon color utilities, and a scanline overlay body effect.",
  "frontend/src/lib/eventIdLookup.ts": "Provides a static lookup map from composite keys (artistId + dateTime nanoseconds) to backend event IDs for all seeded events, with a helper function `getEventId` to retrieve an ID from an Event object.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/ArtistDetailPage.tsx": "Displays a single artist's detail page with a header image, genre, and a sorted grid of upcoming events fetched via React Query hooks.",
  "frontend/src/pages/ArtistsPage.tsx": "Lists all artists in a searchable, filterable grid with event counts per artist, and shows an admin init button for authenticated users.",
  "frontend/src/pages/DiscoverPage.tsx": "Browse and filter all events by artist, city, and date range, with artist chip filters and a hero banner; shows an admin init button when authenticated.",
  "frontend/src/pages/MyRadarPage.tsx": "Personal radar page showing a logged-in user's saved events and tracked artists; redirects unauthenticated users to a login prompt.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with a pulsing radio icon and a link back to the home route.",
  "frontend/src/utils/ticketSearch.ts": "Utility that builds ticket search URLs for DICE or Songkick given an artist name.",
  "frontend/src/utils/travelLinks.ts": "Provides a city-name-to-IATA-code mapping and helper functions to normalise city names and resolve them to Skyscanner-compatible airport codes for building travel links.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and cleaning URL parameters from both query strings and hash-based routes, using sessionStorage for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Space Grotesk/Mono), OKLCH-based color tokens, zero border-radius, neon glow shadows, and flicker/pulse animations for a dark neon UI theme.",
  "project_state.json": "Project state metadata tracking existing features and pending work to restore the AdminInitButton component, fix the useActor hook readiness, and verify backend seed data initialization access control."
}