{
  "backend/main.mo": "Main Motoko actor defining Event, Artist, and UserProfile types with CRUD operations, access control, artist tracking, radar events, and seed data initialization for a techno event tracking app.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing their purpose and key implementation details.",
  "frontend/index.css": "Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including background, foreground, card, border, and chart color tokens.",
  "frontend/index.html": "HTML entry point for the Techno Beacon app, loading the React app via main.tsx and setting the page title and favicon.",
  "frontend/src/App.tsx": "Root React component setting up TanStack Router with routes for Discover, Artists, Artist Detail, and My Radar pages, plus a Layout component with Navigation, footer, ProfileSetupModal, and Toaster.",
  "frontend/src/components/AdminInitButton.tsx": "Admin-only button component that triggers backend seed data initialization, showing loading/success/error states with toast notifications and an admin badge.",
  "frontend/src/components/ArtistCard.tsx": "Artist card component displaying image, name, genre, event count, a follow/unfollow toggle button, and navigation to the artist detail page, with a popup for quick event preview.",
  "frontend/src/components/ArtistEventPopup.tsx": "A popup component that displays events for a specific artist, allowing users to add/remove events from their radar and open a trip planner modal.",
  "frontend/src/components/EventCard.tsx": "A card component that displays event details (title, date, venue) with radar toggle and trip planner functionality for a single event.",
  "frontend/src/components/EventFilters.tsx": "A filter bar component with inputs for artist name, city, and date range, including active filter badges and a clear-all button.",
  "frontend/src/components/LoginPrompt.tsx": "A centered prompt component that displays a login button with a loading state for unauthenticated users trying to access protected features.",
  "frontend/src/components/Navigation.tsx": "A sticky top navigation bar with logo, nav links, and auth controls (login/logout) supporting both desktop and mobile layouts.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts newly authenticated users to enter their name to complete profile setup before accessing the app.",
  "frontend/src/components/SourceBadge.tsx": "A small badge component that displays the event data source (e.g., RA, Bandsintown) with source-specific color styling.",
  "frontend/src/components/TripPlannerModal.tsx": "A modal dialog component that helps users plan travel to a concert event by entering their home city, selecting a budget level, and generating Skyscanner flight and Booking.com hotel links with pre-filled dates.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using TanStack Query, supporting both anonymous and authenticated (Internet Identity) access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider for React, wrapping DFINITY's AuthClient to expose login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Centralizes TanStack Query hooks for all backend data operations including fetching events, artists, user profiles, and tracked artists, as well as mutations for saving profiles and toggling artist tracking.",
  "frontend/src/index.css": "Global stylesheet defining a dark industrial techno theme with OKLCH color tokens, neon amber/green accent utilities, Space Grotesk/Mono fonts, and custom animations like neon pulse and glow effects.",
  "frontend/src/lib/eventIdLookup.ts": "A static lookup table mapping composite keys of artistId and dateTime nanoseconds to backend event IDs, with a helper function to retrieve an event's backend ID from those two values.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with TanStack Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/ArtistDetailPage.tsx": "Displays a single artist's profile with image, genre, and upcoming events list, supporting follow/unfollow via Internet Identity authentication.",
  "frontend/src/pages/ArtistsPage.tsx": "Lists all artists with search filtering, per-artist event counts, and tracked-artist state, with error handling and retry support.",
  "frontend/src/pages/DiscoverPage.tsx": "Shows all upcoming techno events with artist/city/date filters, a hero banner, and an admin seed button when no data is present.",
  "frontend/src/pages/MyRadarPage.tsx": "Authenticated personal radar page showing events for tracked artists with ticket links to Dice and Songkick; redirects unauthenticated users to a login prompt.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with a pulsing radio icon and a link back to the home route.",
  "frontend/src/utils/ticketSearch.ts": "Utility that builds search URLs for Dice or Songkick given an artist name.",
  "frontend/src/utils/travelLinks.ts": "Provides a city-name-to-IATA-code mapping and normalisation helpers for generating Skyscanner travel links from event city names.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including neon color palette, Space Grotesk/Mono fonts, box shadows, and keyframe animations for a dark techno-themed UI.",
  "project_state.json": "Project state snapshot for Techno Beacon app (version 55), documenting architecture, known issues (artist data not loading), and existing features like Discover, Artists, and My Radar pages."
}