{
  "backend/main.mo": "Main Motoko actor defining Event, Artist, and UserProfile types with CRUD operations, access-controlled user profile management, artist/event seed data initialization, and radar event tracking per user.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their IDs, titles, associated files, component dependencies, test IDs, and confidence levels for radar event hooks, EventCard radar button, ArtistEventPopup radar button, and related UI changes.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each file's purpose, covering hooks, components, pages, and configuration files in the React frontend.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark themes including background, foreground, card, border, and chart color tokens.",
  "frontend/index.html": "HTML entry point for the Techno Beacon app, loading the favicon and mounting the React app via the `/src/main.tsx` module script.",
  "frontend/src/App.tsx": "Root React app component setting up TanStack Router with routes for Discover, Artists, ArtistDetail, and MyRadar pages, plus a Layout wrapper with Navigation, footer, ProfileSetupModal, and Toaster.",
  "frontend/src/components/AdminInitButton.tsx": "Admin-only UI button component that triggers seed data initialization via the `useInitializeSeedData` mutation hook, showing success/error toast notifications and an admin badge.",
  "frontend/src/components/ArtistCard.tsx": "Displays an artist card with image, genre, event count, and follow/unfollow toggle. Clicking the card opens an event popup; a separate button navigates to the artist detail page.",
  "frontend/src/components/ArtistEventPopup.tsx": "Modal dialog that lists all upcoming events for a given artist, with options to add/remove each event from the user's Radar and open a trip planner.",
  "frontend/src/components/EventCard.tsx": "Renders a single event card showing artist, title, date/time, location, and source badge, with buttons to toggle the event on the user's Radar and open a trip planner modal.",
  "frontend/src/components/EventFilters.tsx": "Provides a filter bar with inputs for artist name, city, and date range to narrow down event listings, including active-filter chips and a clear button.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a centered authentication prompt with a login button that triggers Internet Identity login, used to gate authenticated features.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with logo, nav links (Discover, Artists, My Radar), and auth controls (login/logout with Internet Identity), supporting both desktop and mobile layouts.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their name to set up their profile, using the `useSaveCallerUserProfile` mutation to persist the data.",
  "frontend/src/components/SourceBadge.tsx": "A small badge component that displays a color-coded label for an event source (e.g., Resident Advisor, Bandsintown), abbreviating known source names.",
  "frontend/src/components/TripPlannerModal.tsx": "A modal that helps users plan travel to an event by collecting a home city and budget level, then generating Skyscanner and Booking.com links with pre-filled dates and destination.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data (artists, events, user profiles, tracked artists), wrapping the ICP actor calls with appropriate caching and auth guards.",
  "frontend/src/index.css": "Global stylesheet that defines a dark industrial techno theme using Tailwind CSS, custom OKLCH color tokens, neon accent utilities, and keyframe animations for glow and pulse effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrappers around the root `App` component.",
  "frontend/src/pages/ArtistDetailPage.tsx": "Displays a single artist's profile with their image, genre, and upcoming events, and allows authenticated users to follow/unfollow the artist via a toggle button.",
  "frontend/src/pages/ArtistsPage.tsx": "Lists all artists with a search filter, showing per-artist event counts and follow state, with error handling and an admin re-seed button.",
  "frontend/src/pages/DiscoverPage.tsx": "Shows a filterable list of upcoming techno events fetched from all artists, with a hero banner, error/retry UI, and an optional admin init button.",
  "frontend/src/pages/MyRadarPage.tsx": "Displays a personalised radar page for logged-in users showing tracked artist events, summary stats, and saved events sorted by date.",
  "frontend/src/pages/NotFoundPage.tsx": "Renders a styled 404 page with a pulsing radio icon and a link back to the home route.",
  "frontend/src/utils/travelLinks.ts": "Provides utility functions to convert city names to Skyscanner IATA codes or URL slugs, and to convert backend nanosecond timestamps to JS Dates.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including neon color palette, Space Grotesk/Mono fonts, box shadows, animations, and plugin imports for typography, container queries, and animate.",
  "project_state.json": "Project state document describing Techno Beacon's architecture, existing features, known issues (artist data not loading, admin seed data broken, production regressions), and overall app summary for a techno event discovery mobile app."
}