{
  "backend/main.mo": "Main Motoko actor defining Event, Artist, and UserProfile types with CRUD operations, access-controlled endpoints for user profiles and radar events, and seed data initialization for techno artists and their events.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing their purpose and key implementation details.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including background, foreground, card, border, and chart color tokens.",
  "frontend/index.html": "Minimal HTML entry point for the Techno Beacon app, loading the React app via /src/main.tsx and setting the favicon and viewport meta.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for Discover, Artists, Artist Detail, and My Radar pages, wrapped in a Layout with Navigation, footer, ProfileSetupModal, and Toaster.",
  "frontend/src/components/AdminInitButton.tsx": "Admin-only button component that triggers backend seed data initialization, showing loading/success/error states with toast notifications and an admin badge.",
  "frontend/src/components/ArtistCard.tsx": "Artist card component displaying image, name, genre, and event count with a follow/unfollow toggle button and click-to-open event popup, navigating to the artist detail page on a separate button.",
  "frontend/src/components/ArtistEventPopup.tsx": "A popup component that displays events for a specific artist, allowing authenticated users to add/remove events from their radar and open a trip planner modal.",
  "frontend/src/components/EventCard.tsx": "A card component for displaying a single event with date, location, and source info, supporting radar toggle and trip planner functionality for authenticated users.",
  "frontend/src/components/EventFilters.tsx": "A filter bar component with inputs for artist name, city, and date range, displaying active filter badges and a clear button when filters are applied.",
  "frontend/src/components/LoginPrompt.tsx": "A centered prompt component that displays a login button with a customizable title and message for unauthenticated users.",
  "frontend/src/components/Navigation.tsx": "A sticky top navigation bar with links to Discover, Artists, and My Radar pages, plus authentication controls for login/logout and user profile display.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts newly authenticated users to enter their name to create a profile, blocking interaction until the form is submitted.",
  "frontend/src/components/SourceBadge.tsx": "A small badge component that displays the event data source (e.g., RA, Bandsintown) with color-coded styling per source.",
  "frontend/src/components/TripPlannerModal.tsx": "A modal dialog component that lets users plan travel to a concert event by entering their home city and budget level, then generates Skyscanner flight and Booking.com hotel links with appropriate dates.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor, reinitializing it when the user's identity changes and invalidating dependent queries accordingly.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider component using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data including events, artists, user profiles, and tracked artists, using the actor from useActor.",
  "frontend/src/index.css": "Global stylesheet that defines a dark industrial techno theme using Tailwind CSS with custom OKLCH color tokens, neon amber/green accent utilities, and Space Grotesk/Space Mono fonts.",
  "frontend/src/lib/eventIdLookup.ts": "Provides a static lookup table mapping composite keys of artistId and dateTime nanoseconds to backend event IDs, with a helper function to retrieve an event's backend ID.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/ArtistDetailPage.tsx": "Displays a single artist's profile (image, name, genre) and their upcoming events, with loading skeletons, error handling with retry, and defensive filtering of stale event data.",
  "frontend/src/pages/ArtistsPage.tsx": "Lists all artists with a search filter, per-artist event counts, and tracking state, including error/loading states and an admin init button when no data is present.",
  "frontend/src/pages/DiscoverPage.tsx": "Main event discovery page with a hero banner, artist/city/date filters, sanitised and sorted event cards, and an optional admin seed button when the canister has no data.",
  "frontend/src/pages/MyRadarPage.tsx": "Authenticated user's personal radar page showing saved/tracked artist events with ticket links to Dice and Songkick, guarded by a login prompt for unauthenticated users.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with a pulsing radio icon and a link back to the home route.",
  "frontend/src/utils/ticketSearch.ts": "Utility that builds search URLs for ticket platforms (Dice and Songkick) given an artist name.",
  "frontend/src/utils/travelLinks.ts": "Provides city-to-IATA airport code mapping and helper functions to generate Skyscanner and Booking.com travel links from event city names.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including neon color palette, box shadows, fonts (Space Grotesk/Mono), OKLCH-based semantic colors, and animation keyframes.",
  "project_state.json": "Project state document for Techno Beacon app tracking version, architecture notes, known issues (artist data not loading, incorrect event dates), and existing/planned features across frontend and backend."
}