{
  "backend/main.mo": "Main Motoko actor defining data types (Event, Artist, UserProfile) and backend logic for managing artists, events, user profiles, radar events, and seed data initialization with role-based access control.",
  "feature_evidence.json": "Feature evidence report listing three related features around fixing AdminInitButton's admin detection, loading state, and useActor readiness signaling, each mapped to specific files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the project's frontend components, pages, hooks, and configuration.",
  "frontend/index.css": "Defines OKLCH-based CSS custom properties for light and dark themes (background, foreground, card, border, chart colors, etc.) using Tailwind's base/components/utilities layers.",
  "frontend/index.html": "HTML entry point for the Techno Beacon app, loading the React app via main.tsx and setting the page title and favicon.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all page routes, wraps the app in QueryClientProvider and ThemeProvider, and renders the Layout with Navigation, ProfileSetupModal, and Toaster.",
  "frontend/src/components/AdminInitButton.tsx": "Admin-only button component that checks admin status via useIsAdmin, shows a loading spinner while resolving, and triggers backend seed data initialization with success/error toast feedback.",
  "frontend/src/components/ArtistCard.tsx": "Displays an artist card with image, genre, event count, and a follow/unfollow button; clicking the card navigates to the artist detail page and a popup shows upcoming events.",
  "frontend/src/components/ArtistEventPopup.tsx": "A dialog popup that lists an artist's upcoming events sorted by date, allowing authenticated users to add/remove events from their radar or open the trip planner.",
  "frontend/src/components/EventCard.tsx": "Renders a single event card with venue, date/time, ticket links, and a radar toggle button; also supports opening a trip planner modal.",
  "frontend/src/components/EventFilters.tsx": "Provides filter inputs for artist name, city, and date range with active filter chips and a clear-all button for filtering event listings.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a centered authentication prompt with a login button using Internet Identity, shown when a user needs to log in to access a feature.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with logo, nav links (Discover, Artists, My Radar), and auth controls (login/logout with user profile display) including a mobile menu.",
  "frontend/src/components/ProfileSetupModal.tsx": "A non-dismissible dialog modal that prompts newly authenticated users to enter their name to set up their profile before using the app.",
  "frontend/src/components/SourceBadge.tsx": "Renders a colored badge for event sources (Resident Advisor, Bandsintown, Festicket) with source-specific neon color styles. Abbreviates 'Resident Advisor' to 'RA'.",
  "frontend/src/components/TripPlannerModal.tsx": "Modal dialog that helps users plan travel to an event by entering a home city and budget level, then generating Skyscanner flight and Booking.com hotel links with appropriate dates.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including events, artists, radar events, and tracked artists, all gated on actor availability and authentication state.",
  "frontend/src/index.css": "Global stylesheet importing Space Grotesk/Mono fonts, defining dark-theme CSS custom properties (neon amber/green palette), and adding utility classes for neon text/border effects and a scanline overlay.",
  "frontend/src/lib/eventIdLookup.ts": "Provides a static lookup map from composite keys (artistId + dateTime nanoseconds) to backend event IDs for all seeded events, with a helper function to retrieve an event's ID.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ArtistDetailPage.tsx": "Displays a single artist's detail page with a header image, genre, and a sorted grid of upcoming events fetched via React Query hooks.",
  "frontend/src/pages/ArtistsPage.tsx": "Lists all artists in a searchable, filterable grid with event counts per artist, and shows an admin init button for authenticated users.",
  "frontend/src/pages/DiscoverPage.tsx": "Browse and filter all events by artist, city, and date range, with artist chip filters and a hero banner; shows an admin init button when authenticated.",
  "frontend/src/pages/MyRadarPage.tsx": "Personal radar page showing a logged-in user's saved events and tracked artists; redirects unauthenticated users to a login prompt.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with a pulsing radio icon and a link back to the home route.",
  "frontend/src/utils/ticketSearch.ts": "Utility that builds ticket search URLs for DICE or Songkick given an artist name.",
  "frontend/src/utils/travelLinks.ts": "Provides a city-to-IATA airport code mapping and helper functions to normalise city names and generate Skyscanner-compatible travel links for event locations.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Space Grotesk/Mono), OKLCH-based color tokens, zero border-radius, neon glow box shadows, and flicker/pulse keyframe animations.",
  "project_state.json": "Project state tracking file recording existing fix features (AdminInitButton visibility, spinner clearing, useActor readiness) and a pending backend audit task (AR-4) to verify admin principal detection."
}