{
  "kind": "build_request",
  "title": "Restore AdminInitButton and seed data initialization functionality",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the AdminInitButton component so that it correctly detects admin status and renders the seed data initialization button for confirmed admins. The button must be visible and functional on the ArtistsPage for admin users, and clicking it must successfully call the backend seed/init function.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "its not, its the same, initialize data not there ect"
        ]
      },
      "acceptanceCriteria": [
        "Admin user sees the 'Initialize Data' button on the ArtistsPage",
        "Clicking the button triggers the backend seed data initialization",
        "The spinner does not run indefinitely — it resolves or times out within 5 seconds",
        "Non-admin users do not see the button"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the useActor hook correctly signals readiness so that admin-gated components like AdminInitButton receive a valid actor reference in time. The hook must not stay in a pending state indefinitely after authentication resolves.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "its not, its the same, initialize data not there ect"
        ]
      },
      "acceptanceCriteria": [
        "useActor resolves to a valid actor within a reasonable time after login",
        "AdminInitButton receives the actor and proceeds past the loading guard",
        "Actor readiness state is correctly propagated to consuming components"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Verify the backend initializeSeedData (or equivalent) function is callable and returns successfully when invoked by an admin principal. Ensure the admin access control check in the backend correctly identifies the admin caller.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "initialize data not there ect"
        ]
      },
      "acceptanceCriteria": [
        "Admin principal can call the seed/init function without an access-denied error",
        "Seed data (artists and events) is persisted to state after initialization",
        "Non-admin principals receive an error when attempting to call the init function"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useActor.ts or frontend/src/hooks/useInternetIdentity.ts directly — propose safe alternatives if hook behavior needs adjustment",
    "All Motoko logic must remain in the single backend/main.mo actor"
  ],
  "nonGoals": [
    "Adding new features or pages",
    "Changing the visual design or theme",
    "Modifying authentication flow beyond what is needed to fix actor readiness"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}