{
  "kind": "build_request",
  "title": "Add Robert Hood artist with 3 real RA events to seed data",
  "projectName": "Techno Beacon",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-75",
      "text": "In the `initializeSeedData` function in `backend/main.mo`, add Robert Hood as a new seeded artist with the following 3 real RA events (all with sourceLabel 'RA' and eventUrl 'https://ra.co'): (1) eventTitle 'Dreaming Festival 2026' — venue 'Parque Norte', Medellin, Colombia, Sat 27 Jun 2026, dateTime ISO '2026-06-27T18:00:00Z'; (2) eventTitle 'Terminal V Festival 2026' — venue 'Royal Highland Centre', Edinburgh, UK, Sat 18 Apr 2026, dateTime ISO '2026-04-18T18:00:00Z'; (3) eventTitle 'The Crave Festival 2026' — venue 'Zuiderpark', The Hague, Netherlands, Sat 6 Jun 2026, dateTime ISO '2026-06-06T16:00:00Z'. Robert Hood must have a unique stable artist ID (e.g. 'robert-hood'), name 'Robert Hood', an imageUrl (empty string or placeholder), and genre 'Detroit Techno / Minimal'. All 3 events must be associated with Robert Hood's artist ID. Retain all existing hard-coded events for all other artists (Dave Clarke 9 events, Jeff Mills 16 events, Richie Hawtin, Joey Beltram, Derrick May, Juan Atkins, Kevin Saunderson, Adam Beyer) unchanged. The `postupgrade` system hook must continue to call `initializeSeedData` unconditionally so all artists including Robert Hood are present on every deploy without manual intervention. After the call, `getArtists` must return Robert Hood and `getEventsByArtist` queried with Robert Hood's artist ID must return all 3 events.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "lets add 1 more artist and events, Robert Hood",
          "Sat, 27 Jun 2026 - Parque Norte - Medellin, Colombia (Dreaming Festival 2026; with Kevin Saunderson)",
          "Sat, 18 Apr 2026 - Royal Highland Centre - Edinburgh, UK (Terminal V Festival 2026)",
          "Sat, 6 Jun 2026 - Zuiderpark - The Hague, Netherlands (The Crave Festival 2026)"
        ]
      },
      "acceptanceCriteria": [
        "Robert Hood artist record exists in the backend with a unique stable ID, name, imageUrl, and genre.",
        "`getArtists` returns Robert Hood alongside all other existing artists.",
        "`getEventsByArtist` queried with Robert Hood's artist ID returns exactly 3 events.",
        "Event 1: 'Dreaming Festival 2026' at Parque Norte, Medellin, Colombia, 2026-06-27T18:00:00Z.",
        "Event 2: 'Terminal V Festival 2026' at Royal Highland Centre, Edinburgh, UK, 2026-04-18T18:00:00Z.",
        "Event 3: 'The Crave Festival 2026' at Zuiderpark, The Hague, Netherlands, 2026-06-06T16:00:00Z.",
        "All 3 events have sourceLabel 'RA' and eventUrl 'https://ra.co'.",
        "All existing event records for Dave Clarke, Jeff Mills, Richie Hawtin, Joey Beltram, Derrick May, Juan Atkins, Kevin Saunderson, and Adam Beyer are retained unchanged.",
        "The `postupgrade` system hook calls `initializeSeedData` unconditionally so Robert Hood is present on every deploy without manual admin button click."
      ]
    },
    {
      "id": "REQ-76",
      "text": "Update the IATA/city slug lookup table in `frontend/src/utils/travelLinks.ts` to include the cities introduced by Robert Hood's new event data that are not already present: Medellin (MDE), Edinburgh (EDI), The Hague (nearest major: AMS). Ensure the Skyscanner and Booking.com deep-link URL generators resolve these city names correctly using the lookup table before constructing URLs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Medellin, Colombia",
          "Edinburgh, UK",
          "The Hague, Netherlands"
        ]
      },
      "acceptanceCriteria": [
        "'Medellin' resolves to 'MDE' in the IATA lookup table.",
        "'Edinburgh' resolves to 'EDI' in the IATA lookup table.",
        "'The Hague' resolves to 'AMS' (nearest major airport) in the IATA lookup table.",
        "Skyscanner deep-link URLs constructed for Robert Hood's events use the resolved IATA codes rather than raw city name strings.",
        "Booking.com deep-link URLs for Robert Hood's events use the correct city name in the `ss` query parameter."
      ]
    },
    {
      "id": "REQ-77",
      "text": "On the frontend, ensure the Artists page grid and the Discover page artist roster strip automatically include Robert Hood once the backend returns him. No hardcoded artist name lists or filtering logic should exclude him. The `useArtists` React Query hook must return all artists from the backend dynamically, and the UI must render Robert Hood's card with his name, event count (3), and a clickable avatar/name that opens the ArtistEventPopup showing his 3 upcoming events.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "lets add 1 more artist and events, Robert Hood"
        ]
      },
      "acceptanceCriteria": [
        "Robert Hood appears on the Artists page as an artist card showing his name and event count of 3.",
        "Robert Hood's name appears in the Discover page artist roster strip.",
        "Clicking Robert Hood's name or avatar on either page opens the ArtistEventPopup.",
        "The ArtistEventPopup for Robert Hood displays all 3 events sorted chronologically: Terminal V (Apr 18), The Crave (Jun 6), Dreaming Festival (Jun 27).",
        "Each event row in the popup shows event title, venue, city, date/time, Dice.fm and Songkick ticket-search buttons, and an Add to Radar toggle.",
        "Robert Hood's events appear in the Discover page main event list sorted chronologically alongside all other seeded events."
      ]
    }
  ],
  "constraints": [
    "All existing event records for Dave Clarke (9), Jeff Mills (16), Richie Hawtin, Joey Beltram, Derrick May, Juan Atkins, Kevin Saunderson, and Adam Beyer must remain unchanged.",
    "The `postupgrade` system hook must continue to call `initializeSeedData` unconditionally.",
    "Do not modify any files listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Adding any artists other than Robert Hood in this build.",
    "Changing the visual theme or layout of existing pages.",
    "Modifying the ticket search, trip planner, or radar logic beyond wiring them to Robert Hood's events through the existing dynamic patterns."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}