{
  "kind": "build_request",
  "title": "Remove Rostock event from Richie Hawtin and Juan Atkins seed data",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-104",
      "text": "In the `initializeSeedData` function in `backend/main.mo`, perform an exhaustive search and removal of every event record associated with the Kulturzentrum Rostock event on Thu 5 Mar 2026 across ALL artist arrays — including Richie Hawtin, Juan Atkins, Joey Beltram, and any other artist. Do not rely on prior partial removals; re-audit the full hard-coded event list for every artist and confirm no event with venue 'Kulturzentrum', city 'Rostock', country 'Germany', or dateTime '2026-03-05T...' survives in any artist's event set. After removal, Richie Hawtin must have exactly one seeded event ('Detroit Love Day 1: Richie Hawtin - Carl Craig - Dennis Ferrer', TBA venue, Detroit, USA, '2026-02-27T22:00:00Z'). All other artist event datasets must remain unchanged. The `postupgrade` system hook must continue to call `initializeSeedData` unconditionally so the corrected data is present on every deploy.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "no its still there"
        ]
      },
      "acceptanceCriteria": [
        "No event with venue containing 'Kulturzentrum', city 'Rostock', or dateTime matching '2026-03-05' exists in any artist's event array after `initializeSeedData` runs.",
        "Richie Hawtin's event list returned by `getEventsByArtist` contains exactly one event: 'Detroit Love Day 1: Richie Hawtin - Carl Craig - Dennis Ferrer' in Detroit on 2026-02-27.",
        "Juan Atkins' event list returned by `getEventsByArtist` contains no Rostock event.",
        "Joey Beltram's event list returned by `getEventsByArtist` contains no Rostock event.",
        "All other artist event counts remain unchanged after the fix.",
        "The `postupgrade` system hook calls `initializeSeedData` unconditionally and the canister enters the running state after upgrade.",
        "`getArtists` returns all 8 artists (Dave Clarke, Jeff Mills, Richie Hawtin, Joey Beltram, Derrick May, Juan Atkins, Kevin Saunderson, Robert Hood) after deploy."
      ]
    },
    {
      "id": "REQ-105",
      "text": "In `frontend/src/lib/eventIdLookup.ts`, perform a thorough audit and remove every entry whose composite key could correspond to the Kulturzentrum Rostock event (Thu 5 Mar 2026, Rostock, Germany) regardless of which artist it is keyed under — including Richie Hawtin, Juan Atkins, and Joey Beltram. Search by dateTime nanoseconds corresponding to '2026-03-05T...' and by any city or venue string matching 'Rostock' or 'Kulturzentrum'. Ensure no stale lookup entry references this event ID.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "no its still there"
        ]
      },
      "acceptanceCriteria": [
        "No entry in `eventIdLookup.ts` has a composite key whose dateTime nanoseconds correspond to any timestamp on 2026-03-05.",
        "No entry references a venue or city string containing 'Rostock' or 'Kulturzentrum'.",
        "The Add to Radar functionality for all other events continues to work correctly using their existing lookup entries."
      ]
    }
  ],
  "constraints": [
    "Do not modify any other artist's event data beyond removing the Rostock event.",
    "Do not change the `radarEvents` stable HashMap or any user-saved radar data.",
    "The `postupgrade` hook must remain and must call `initializeSeedData` unconditionally.",
    "All immutable frontend paths (hooks/useInternetIdentity.ts, hooks/useActor.ts, main.tsx, components/ui) must not be modified."
  ],
  "nonGoals": [
    "Adding new events or artists.",
    "Changing any other event dates or data.",
    "Modifying frontend pages beyond the eventIdLookup.ts cleanup.",
    "Changing authentication or routing logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}