{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace Dave Clarke seed data with fully corrected verified event records",
  "requirements": [
    {
      "id": "REQ-109",
      "summary": "Update Dave Clarke event lookup entries in frontend to match corrected backend venue strings and dateTimes",
      "acceptanceCriteria": [
        "Each of the 9 Dave Clarke events has a corresponding entry in the lookup table matching the exact backend event ID.",
        "No stale or incorrect composite keys remain for Dave Clarke events.",
        "Add to Radar button works correctly for all 9 Dave Clarke events after the update.",
        "Lookup entries for all other artists are unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/eventIdLookup.ts",
          "operation": "modify",
          "description": "Update all Dave Clarke event lookup entries to reflect the corrected venue strings and dateTimes from the backend seed data. Specifically: (1) update or create the Vancouver event entry with venue 'TBA (Industrial 236 Warehouse / Vantek Warehouse)' and dateTime '2026-03-06T22:00:00Z' in nanoseconds; (2) update or create the Toronto event entry with venue '821 Runnymede Rd (or 131 McCormack St)' and dateTime '2026-03-07T22:00:00Z' in nanoseconds; (3) update or create the Nancy WONDER RAVE event entry with dateTime '2026-03-13T22:00:00Z' in nanoseconds; (4) update or create the Paris OFF THE GRID event entry with dateTime '2026-03-14T22:00:00Z' in nanoseconds; (5) confirm the London fabric event entry reflects dateTime '2026-04-04T22:00:00Z' in nanoseconds; (6) confirm the Brighton Concorde 2 event entry reflects dateTime '2026-05-15T22:00:00Z' in nanoseconds; (7) confirm the Ostend Klein Strand event entry reflects dateTime '2026-07-10T18:00:00Z' in nanoseconds; (8) confirm the Cardiff District Cardiff event entry reflects dateTime '2026-07-24T22:00:00Z' in nanoseconds; (9) confirm the Iceland Hellissandur event entry reflects dateTime '2027-08-12T20:00:00Z' in nanoseconds. Remove any stale Dave Clarke lookup entries whose composite keys (artistId + dateTime nanoseconds) no longer match the corrected backend event IDs. Preserve all lookup entries for other artists (Jeff Mills, Richie Hawtin, Joey Beltram, Derrick May, Juan Atkins, Kevin Saunderson, Robert Hood) unchanged. Ensure the getEventId helper function continues to work correctly with the updated lookup table so that Add to Radar functionality resolves the correct backend event IDs for all 9 Dave Clarke events."
        }
      ]
    }
  ]
}