{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Dave Clarke event data to match verified RA listings",
  "requirements": [
    {
      "id": "REQ-107",
      "summary": "Update eventIdLookup.ts to reflect corrected Dave Clarke event dateTimes and venues, ensuring Add to Radar functionality works with exact backend event IDs",
      "acceptanceCriteria": [
        "The eventIdLookup table contains up-to-date composite keys matching the corrected dateTimes and venues for all 9 Dave Clarke events.",
        "No stale lookup entries remain for Dave Clarke events that have had their dateTime or venue changed.",
        "The Add to Radar button on Dave Clarke event cards correctly resolves to valid backend event IDs after the update.",
        "All other entries in eventIdLookup.ts are unaffected."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/eventIdLookup.ts",
          "operation": "modify",
          "description": "Update the eventIdLookup table entries for Dave Clarke's 9 events to match the corrected venue strings and dateTimes from REQ-106. Specifically: (1) Update the Vancouver event entry to venue 'TBA (Industrial 236 Warehouse / Vantek Warehouse)' and dateTime '2026-03-06T22:00:00Z'; (2) Update the Toronto event entry to venue '821 Runnymede Rd (or 131 McCormack St)' and dateTime '2026-03-07T22:00:00Z'; (3) Update the Brighton Concorde 2 event entry to dateTime '2026-05-15T22:00:00Z'; (4) Update the Cardiff District Cardiff event entry to dateTime '2026-07-24T22:00:00Z'. Update the Nancy, Paris, London, Ostend, and Iceland event entries if their composite keys changed. Remove any stale entries for Dave Clarke events whose venue or dateTime no longer matches the backend. Verify that the composite key calculation (artistId + dateTime nanoseconds) aligns with the new backend event IDs so that getEventIdFromLookup returns the correct backend event ID for Add to Radar operations."
        }
      ]
    }
  ]
}