{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore AdminInitButton and seed data initialization functionality",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the AdminInitButton component so that it correctly detects admin status and renders the seed data initialization button for confirmed admins",
      "acceptanceCriteria": [
        "Admin user sees the 'Initialize Data' button on the ArtistsPage",
        "Clicking the button triggers the backend seed data initialization",
        "The spinner does not run indefinitely — it resolves or times out within 5 seconds",
        "Non-admin users do not see the button"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminInitButton.tsx",
          "operation": "modify",
          "description": "Review and fix the admin detection logic to ensure it correctly receives actor and identity state from useActor and useIsAdmin hooks. Verify the 5-second timeout guard implemented with useRef is properly clearing the timer on component unmount. Ensure the loading state correctly transitions when the actor becomes available and admin status is confirmed. Add explicit error handling for the initializeSeedData call with user-facing feedback. Verify the authorization component's usage instructions are followed for admin-only UI rendering."
        },
        {
          "path": "frontend/src/pages/ArtistsPage.tsx",
          "operation": "modify",
          "description": "Ensure AdminInitButton is properly rendered on the ArtistsPage and receives necessary context. Verify the component is positioned where admins can easily find it. Confirm the page waits for authentication state to stabilize before rendering admin-gated components."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the useActor hook correctly signals readiness so that admin-gated components like AdminInitButton receive a valid actor reference in time",
      "acceptanceCriteria": [
        "useActor resolves to a valid actor within a reasonable time after login",
        "AdminInitButton receives the actor and proceeds past the loading guard",
        "Actor readiness state is correctly propagated to consuming components"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review the useIsAdmin hook implementation to ensure it correctly waits for actor availability before querying admin status. Add proper enabled conditions that check both actor presence and authentication state. Ensure the hook returns consistent loading/fetching states that components can rely on to avoid premature rendering. Verify the query is properly invalidated when actor changes or authentication state updates."
        },
        {
          "path": "frontend/src/components/AdminInitButton.tsx",
          "operation": "modify",
          "description": "Update the component to properly consume the loading and fetching states from both useActor and useIsAdmin hooks. Ensure the component shows appropriate loading UI while waiting for actor readiness and admin status resolution. Add defensive checks for actor availability before attempting to call backend functions. Implement proper error boundaries for actor initialization failures."
        }
      ]
    }
  ]
}